<!DOCTYPE html>
<html lang="fr">
  <head>
    <meta charset="utf-8" />
    <title>Services de Gitoyen</title>
    <link rel="stylesheet"
      href="/theme/css/main.css" />



    <!--[if IE]>
      <script src="https://html5shiv.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->
  </head>

  <body id="index" class="home">
    <header id="banner" class="body">
      <h1>
        <a href="/">Gitoyen
        </a>
      </h1>
      <nav>
        <ul>
          <li >
            <a href="/">Accueil</a>
          </li>
          <li >
            <a href="/gitoyen.html">Gitoyen</a>
          </li>
          <li  class="active">
            <a href="/services-de-gitoyen.html">Nos Services</a>
          </li>
          <li >
            <a href="/cote-technique.html">Côté technique</a>
          </li>
          <li >
            <a href="/blog.html">Blog</a>
          </li>
          <li >
            <a href="/contact.html">Contact</a>
          </li>
        </ul>
      </nav>
    </header><!-- /#banner -->

<section id="content" class="body">
    <h1 class="entry-title">Services de Gitoyen</h1>
    <nav class="toc">
      <div id="toc"><ul><li><a class="toc-href" href="#" title="Services de Gitoyen">Services de Gitoyen</a><ul><li><a class="toc-href" href="#transit-internet" title="Transit Internet">Transit Internet</a></li><li><a class="toc-href" href="#hebergement-dequipement" title="H&eacute;bergement d" équipement'="">H&eacute;bergement d'&eacute;quipement</a></li><li><a class="toc-href" href="#lir-obtention-de-ressources-internet" title="LIR / Obtention de ressources Internet">LIR / Obtention de ressources Internet</a></li><li><a class="toc-href" href="#commutation-et-routage" title="Commutation et Routage">Commutation et Routage</a></li><li><a class="toc-href" href="#quelques-cas-dusage" title="Quelques cas d" usage'="">Quelques cas d'usage</a></li><li><a class="toc-href" href="#comment-etablir-un-peering-avec-gitoyen" title="Comment &eacute;tablir un peering avec Gitoyen ?">Comment &eacute;tablir un peering avec Gitoyen ?</a></li><li><a class="toc-href" href="#points-de-peering" title="Points de peering">Points de peering</a></li></ul></li></ul></div>
    </nav>
    
    <p>Gitoyen fournit plusieurs services &agrave; ses membres et ses clients.</p>
<h1>Description des services</h1>
<h2 id="transit-internet">Transit Internet</h2>
<p>Gitoyen est un op&eacute;rateur Internet disposant de ses propres liens de
communication avec le reste d'Internet. Dans ce cadre nous sommes en mesure de
fournir une vue compl&egrave;te d'Internet (du <strong>Transit</strong>)  &agrave; nos membres ou nos
clients.</p>
<h2 id="hebergement-dequipement">H&eacute;bergement d'&eacute;quipement</h2>
<p>Gitoyen dispose de deux points de pr&eacute;sence bas&eacute;s &agrave; Paris avec notre propre
espace d'h&eacute;bergement d'&eacute;quipement. L'un &agrave; T&eacute;l&eacute;house - Paris Voltaire et l'autre
&agrave; Paris Bourse.</p>
<p>Nous sommes en mesure de proposer de l'<strong>h&eacute;bergement d'&eacute;quipement</strong> &agrave; nos
membres et nos clients.</p>
<h2 id="lir-obtention-de-ressources-internet">LIR / Obtention de ressources Internet</h2>
<p>Gitoyen est un <em>registre local d'Internet</em> (LIR). Cela lui donne la possibilit&eacute;
d'assigner des ressources : blocs d'adresses IP ou num&eacute;ros d'AS.</p>
<p>Il y a deux types de ressources factur&eacute;es :</p>
<ul>
<li>
<p>Celles n&eacute;cessitant un contrat sp&eacute;cifique avec le LIR pour laquelle le RIPE
  impose une facturation sp&eacute;cifique (les ressources <strong>Provider Independant
  (PI)</strong>) ;</p>
</li>
<li>
<p>Les autres ne n&eacute;cessitant pas de contrat sp&eacute;cifique (<strong>Provider Aggregate
  (PA)</strong>, <strong>Autonomous System (AS)</strong>.</p>
</li>
</ul>
<h2 id="commutation-et-routage">Commutation et Routage</h2>
<p>Nous proposons &agrave; nos membres la possibilit&eacute; d'utiliser :</p>
<ul>
<li>
<p><strong>l'infrastructure de commutation</strong> de Gitoyen, c'est &agrave; dire l'utilisation de
  ports r&eacute;seaux de nos switchs pour leurs besoins propres ;</p>
</li>
<li>
<p><strong>l'infrastructure de routage</strong> de Gitoyen, c'est &agrave; dire la possibilit&eacute;
  d'utiliser les routeurs et l'AS de Gitoyen pour annoncer leurs propres
  r&eacute;seaux. L'infrastructure de routage inclut la commutation.</p>
</li>
</ul>
<h1>Les tarifs</h1>
<p>TODO: ajouter le pdf ou bien faire un tableau html</p>
<h2 id="quelques-cas-dusage">Quelques cas d'usage</h2>
<h3>Ressources Internet pour monter un petit FAI ou un h&eacute;bergeur de services</h3>
<p>Pour une petite structure n&eacute;cessitant du r&eacute;seau, il vous sera n&eacute;cessaire
d'avoir vos propres blocs d'adresses. Pour cela il vous suffit d'adh&eacute;rer et de
prendre une ressource pour un bloc d'adresses IPv4, une autre pour un bloc
d'adresses IPv6 et &eacute;ventuellement une derni&egrave;re pour avoir un AS, selon les
besoins.</p>
<h3>Livraison r&eacute;seau via Gitoyen</h3>
<p>Pour avoir une livraison chez Gitoyen (par exemple en amenant un c&acirc;ble, ou en
utilisant une machine virtuelle d'infrastructure chez Gitoyen), cela signifie
payer le transit et l'infrastructure de commutation.</p>
<p><strong>Remarque :</strong> la machine virtuelle d'infrastructure est &agrave; la discr&eacute;tion du
membre mais n'a pour but que d'&eacute;tablir un lien Ethernet &laquo; virtuel &raquo; entre
Gitoyen et le r&eacute;seau du membre (via openvpn, gre, ipsec, etc.).</p>
<h3>Annoncer son r&eacute;seau avec les routeurs de Gitoyen</h3>
<p>Il est aussi possible d'utiliser directement les routeurs et l'AS de Gitoyen
pour annoncer son r&eacute;seau, dans ce cas il s'agit du tarif infrastructure de
routage (qui comprend l'infrastructure de commutation).</p>
<p>Pour un exemple chiffr&eacute; (par rapport &agrave; Gitoyen), pour une petite asso (moins de
20&nbsp;000&nbsp;&euro; de CA) dans un cas type, sans parler de l'adh&eacute;sion cela donne :</p>
<h1>Peering</h1>
<p>Gitoyen est un op&eacute;rateur courtois et ouvert. Notre politique de
peering est ouverte elle aussi : Il vous suffit de nous demander par
mail &agrave; peering (at) gitoyen (dot) net.</p>
<p>Nous avons d&eacute;j&agrave; une bonne centaine d'accords de peering. Vous pouvez aussi utiliser l'outil Looking Glass ou voir la base RPSL de nos peerings dans la base du RIPE-NCC.</p>
<h2 id="comment-etablir-un-peering-avec-gitoyen">Comment &eacute;tablir un peering avec Gitoyen ?</h2>
<p>Pour monter un peering avec Gitoyen, vous aurez besoin des informations techniques suivantes :</p>
<ul>
<li>Notre num&eacute;ro de syst&egrave;me autonome est AS20766</li>
<li>Nous annon&ccedil;ons l'AS-Macro AS-GITOYEN.</li>
<li>l'email du NOC est <code>noc@</code></li>
<li>Nous n'utilisons pas la signature MD5 des sessions BGP. Si vous vous demandez pourquoi, rendez-vous dans la RFC 2385 chapitre 4.</li>
</ul>
<h2 id="points-de-peering">Points de peering</h2>
<p>Nos points de peering sont list&eacute;s sur la page de l'AS20766 sur <a href="https://www.peeringdb.com/view.php?asn=20766">peeringdb</a></p>
</section>

    <footer id="contentinfo" class="body">
    </footer>

  </body>
</html>